app/nvmf_iaa/fio_engine/results_lat/1k_latency.out
=== run_latency.sh ===
timestamp: 2026-04-06 19:30:43
bs: 1k
size: 1k
fio: /home/xuanboj2/spdk-iaa/app/nvmf_iaa/fio/fio
engine: ./iaanic.so
poll_usleep: 0
write_phase: (g=0): rw=write, bs=(R) 1024B-1024B, (W) 1024B-1024B, (T) 1024B-1024B, ioengine=snic_phase1, iodepth=1
read_phase: (g=0): rw=read, bs=(R) 1024B-1024B, (W) 1024B-1024B, (T) 1024B-1024B, ioengine=snic_phase1, iodepth=1
fio-3.41-142-g698f
Starting 2 threads
EAL: '-c <coremask>' option is deprecated, and will be removed in a future release
EAL: 	Use '-l <corelist>' or '--lcores=<corelist>' option instead
[Init] Probing Target 192.168.200.20:4420...
[Init] Attaching to 192.168.200.20
[Init] Attached to NVMe Controller
[Init] Allocated IO QPair. Negotiated QID: 1
[RDMA] Resolving SNIC address 192.168.200.11:18515...
[RDMA] Resolving route...
[RDMA] Connecting to SNIC...
[RDMA] SNIC Connection established!
[Init] Registering Memory...
[Init] Cleaning IAA Completion Buffer
[Init] Mapping IAA Portal at /dev/iax/wq1.0...
[Init] Allocating COMP/DECOMP AECS buffers
[Init] COMP AECS loaded:   addr=0x7ce184114040 size=1568
[Init] DECOMP AECS loaded: addr=0x7ce184119140 size=5376
[Init] Initing SETUP MSG...
[Init] All systems OK. Staging Buffer: 32 MB (Hugepages)
[Init] Sending SETUP Message to SNIC...
[SETUP] comp_aecs_addr=0x7ce184114040 comp_aecs_size=1568
[SETUP] decomp_aecs_addr=0x7ce184119140 decomp_aecs_size=5376
[Init] SETUP Message Sent successfully.
sizeof(struct snic_setup_msg) = 80

write_phase: (groupid=0, jobs=1): err= 0: pid=142610: Mon Apr  6 19:30:44 2026
  write: IOPS=1000, BW=1000KiB/s (1024kB/s)(1024B/1msec)
    clat (nsec): min=84258, max=84258, avg=84258.00, stdev= 0.00
     lat (nsec): min=85546, max=85546, avg=85546.00, stdev= 0.00
    clat percentiles (nsec):
     |  1.00th=[84480],  5.00th=[84480], 10.00th=[84480], 20.00th=[84480],
     | 30.00th=[84480], 40.00th=[84480], 50.00th=[84480], 60.00th=[84480],
     | 70.00th=[84480], 80.00th=[84480], 90.00th=[84480], 95.00th=[84480],
     | 99.00th=[84480], 99.50th=[84480], 99.90th=[84480], 99.95th=[84480],
     | 99.99th=[84480]
  lat (usec)   : 100=100.00%
  cpu          : usr=0.00%, sys=0.00%, ctx=0, majf=0, minf=1
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0.00ns, window=0.00ns, percentile=100.00%, depth=1
read_phase: (groupid=0, jobs=1): err= 0: pid=142611: Mon Apr  6 19:30:44 2026
  read: IOPS=1000, BW=1000KiB/s (1024kB/s)(1024B/1msec)
    clat (nsec): min=82884, max=82884, avg=82884.00, stdev= 0.00
     lat (nsec): min=84150, max=84150, avg=84150.00, stdev= 0.00
    clat percentiles (nsec):
     |  1.00th=[82432],  5.00th=[82432], 10.00th=[82432], 20.00th=[82432],
     | 30.00th=[82432], 40.00th=[82432], 50.00th=[82432], 60.00th=[82432],
     | 70.00th=[82432], 80.00th=[82432], 90.00th=[82432], 95.00th=[82432],
     | 99.00th=[82432], 99.50th=[82432], 99.90th=[82432], 99.95th=[82432],
     | 99.99th=[82432]
  lat (usec)   : 100=100.00%
  cpu          : usr=0.00%, sys=0.00%, ctx=0, majf=0, minf=4
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0.00ns, window=0.00ns, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1000KiB/s (1024kB/s), 1000KiB/s-1000KiB/s (1024kB/s-1024kB/s), io=1024B (1024B), run=1-1msec
  WRITE: bw=1000KiB/s (1024kB/s), 1000KiB/s-1000KiB/s (1024kB/s-1024kB/s), io=1024B (1024B), run=1-1msec