app/nvmf_iaa/fio_engine/results_lat/2k_latency.out
=== run_latency.sh ===
timestamp: 2026-04-06 19:24:44
bs: 2k
size: 2k
fio: /home/xuanboj2/spdk-iaa/app/nvmf_iaa/fio/fio
engine: ./iaanic.so
poll_usleep: 0
write_phase: (g=0): rw=write, bs=(R) 2048B-2048B, (W) 2048B-2048B, (T) 2048B-2048B, ioengine=snic_phase1, iodepth=1
read_phase: (g=0): rw=read, bs=(R) 2048B-2048B, (W) 2048B-2048B, (T) 2048B-2048B, ioengine=snic_phase1, iodepth=1
fio-3.41-142-g698f
Starting 2 threads
EAL: '-c <coremask>' option is deprecated, and will be removed in a future release
EAL: 	Use '-l <corelist>' or '--lcores=<corelist>' option instead
[Init] Probing Target 192.168.200.20:4420...
[Init] Attaching to 192.168.200.20
[Init] Attached to NVMe Controller
[Init] Allocated IO QPair. Negotiated QID: 1
[RDMA] Resolving SNIC address 192.168.200.11:18515...
[RDMA] Resolving route...
[RDMA] Connecting to SNIC...
[RDMA] SNIC Connection established!
[Init] Registering Memory...
[Init] Cleaning IAA Completion Buffer
[Init] Mapping IAA Portal at /dev/iax/wq1.0...
[Init] Allocating COMP/DECOMP AECS buffers
[Init] COMP AECS loaded:   addr=0x7dad24114040 size=1568
[Init] DECOMP AECS loaded: addr=0x7dad24119140 size=5376
[Init] Initing SETUP MSG...
[Init] All systems OK. Staging Buffer: 32 MB (Hugepages)
[Init] Sending SETUP Message to SNIC...
[SETUP] comp_aecs_addr=0x7dad24114040 comp_aecs_size=1568
[SETUP] decomp_aecs_addr=0x7dad24119140 decomp_aecs_size=5376
[Init] SETUP Message Sent successfully.
sizeof(struct snic_setup_msg) = 80

write_phase: (groupid=0, jobs=1): err= 0: pid=142158: Mon Apr  6 19:24:48 2026
  write: IOPS=1000, BW=2000KiB/s (2048kB/s)(2048B/1msec)
    clat (nsec): min=81156, max=81156, avg=81156.00, stdev= 0.00
     lat (nsec): min=82414, max=82414, avg=82414.00, stdev= 0.00
    clat percentiles (nsec):
     |  1.00th=[81408],  5.00th=[81408], 10.00th=[81408], 20.00th=[81408],
     | 30.00th=[81408], 40.00th=[81408], 50.00th=[81408], 60.00th=[81408],
     | 70.00th=[81408], 80.00th=[81408], 90.00th=[81408], 95.00th=[81408],
     | 99.00th=[81408], 99.50th=[81408], 99.90th=[81408], 99.95th=[81408],
     | 99.99th=[81408]
  lat (usec)   : 100=100.00%
  cpu          : usr=0.00%, sys=0.00%, ctx=0, majf=0, minf=1
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0.00ns, window=0.00ns, percentile=100.00%, depth=1
read_phase: (groupid=0, jobs=1): err= 0: pid=142159: Mon Apr  6 19:24:48 2026
  read: IOPS=1000, BW=2000KiB/s (2048kB/s)(2048B/1msec)
    clat (nsec): min=73148, max=73148, avg=73148.00, stdev= 0.00
     lat (nsec): min=74072, max=74072, avg=74072.00, stdev= 0.00
    clat percentiles (nsec):
     |  1.00th=[73216],  5.00th=[73216], 10.00th=[73216], 20.00th=[73216],
     | 30.00th=[73216], 40.00th=[73216], 50.00th=[73216], 60.00th=[73216],
     | 70.00th=[73216], 80.00th=[73216], 90.00th=[73216], 95.00th=[73216],
     | 99.00th=[73216], 99.50th=[73216], 99.90th=[73216], 99.95th=[73216],
     | 99.99th=[73216]
  lat (usec)   : 100=100.00%
  cpu          : usr=0.00%, sys=0.00%, ctx=0, majf=0, minf=4
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0.00ns, window=0.00ns, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=2000KiB/s (2048kB/s), 2000KiB/s-2000KiB/s (2048kB/s-2048kB/s), io=2048B (2048B), run=1-1msec
  WRITE: bw=2000KiB/s (2048kB/s), 2000KiB/s-2000KiB/s (2048kB/s-2048kB/s), io=2048B (2048B), run=1-1msec